{"input": "He earned a Doctor of Historical Science degree in 2013 and became a professor in 2016 Biography Vitaliy Mykhaylovskiy was born on 10 November 1974 in Kamianets Podilskyi Khmelnytskyi Oblast", "output": "He earned a Doctor of Historical Science degree in 2013 and became a professor in 2016.\n\n\n== Biography ==\nVitaliy Mykhaylovskiy was born on 10 November 1974 in Kamianets-Podilskyi, Khmelnytskyi Oblast."}
{"input": "In 1997 he graduated from the Kamianets Podilskyi Pedagogical Institute", "output": "In 1997, he graduated from the Kamianets-Podilskyi Pedagogical Institute."}
{"input": "A student of Professor Natalia Yakovenko.", "output": "A student of Professor Natalia Yakovenko."}
{"input": "Between 1998 and 2005 Mykhaylovskiy worked at the Association of Ukrainian Writers.", "output": "Between 1998 and 2005, Mykhaylovskiy worked at the Association of Ukrainian Writers."}
{"input": "From 2005 to 2008 he was employed at Kyiv Slavonic University", "output": "From 2005 to 2008, he was employed at Kyiv Slavonic University."}
{"input": "Between 2008 and 2010, he worked at the National University of Kyiv Mohyla Academy", "output": "Between 2008 and 2010, he worked at the National University of Kyiv-Mohyla Academy."}
{"input": "Since 2010, he has been at the Borys Grinchenko Kyiv Metropolitan University, where he became department chair in 2015 and professor of the Department of History of Ukraine in 2016.", "output": "Since 2010, he has been at the Borys Grinchenko Kyiv Metropolitan University, where he became department chair in 2015 and professor of the Department of History of Ukraine in 2016."}
{"input": "According to Mykhaylovskiy This discovery happened quite unexpectedly", "output": "According to Mykhaylovskiy, “This discovery happened quite unexpectedly."}
{"input": "Podilska shliakhta v druhii polovyni XIV 70 kh rokakh XVI st (2012 , Prykladom svoikh predkiv. .", "output": "Podilska shliakhta v druhii polovyni XIV — 70-kh rokakh XVI st.\" (2012), \"Prykladom svoikh predkiv..."}
{"input": "His other works include Istoriia mova heohrafiia: toponimy seredniovichnoho Podillia (2021) \"Nashi koroli – reges nostri", "output": "His other works include \"Istoriia, mova, heohrafiia: toponimy seredniovichnoho Podillia\" (2021), \"Nashi koroli – reges nostri."}
{"input": "Volodari ta dynastii v istorii Ukrainy (1340–1795)\" (2023), \"Reges nostri Władcy i dynastie w historii Ukrainy (1340–1795)\" (2024), and \"Reges nostri.", "output": "Volodari ta dynastii v istorii Ukrainy (1340–1795)\" (2023), \"Reges nostri Władcy i dynastie w historii Ukrainy (1340–1795)\" (2024), and \"Reges nostri."}
{"input": "Monarchs and dynasties in the history of Ukraine 1340 1795 2024 References", "output": "Monarchs and dynasties in the history of Ukraine (1340–1795)\" (2024).\n\n\n== References =="}
{"input": "Weiwangzhuang Chinese 徽王庄镇 is a town in Ling County Dezhou in northwestern Shandong province China References", "output": "Weiwangzhuang (Chinese: 徽王庄镇) is a town in Ling County, Dezhou, in northwestern Shandong province, China.\n\n\n== References =="}
{"input": "The Striplin Lone Ranger is a family of American ultralight aircraft that was designed by Ken Striplin", "output": "The Striplin Lone Ranger is a family of American ultralight aircraft that was designed by Ken Striplin."}
{"input": "The aircraft was supplied as a kit for amateur construction Design and development The aircraft was designed to comply with the US FAR 103 Ultralight Vehicles rules including the category APOS s maximum empty weight of 254 lb 115 kg", "output": "The aircraft was supplied as a kit for amateur construction.\n\n\n== Design and development ==\nThe aircraft was designed to comply with the US FAR 103 Ultralight Vehicles rules, including the category's maximum empty weight of 254 lb (115 kg)."}
{"input": "The aircraft has a standard empty weight of 245 lb 111 kg", "output": "The aircraft has a standard empty weight of 245 lb (111 kg)."}
{"input": "It features a high wing a single seat open cockpit tricycle landing gear and a single engine in tractor configuration", "output": "It features a high-wing, a single-seat, open cockpit, tricycle landing gear and a single engine in tractor configuration."}
{"input": "The Lone Ranger was designed to overcome pitch stability problems found in the earlier Striplin FLAC tailless aircraft.", "output": "The Lone Ranger was  designed to overcome pitch stability problems found in the earlier Striplin FLAC tailless aircraft."}
{"input": "Because they were no longer needed the FLAC APOS s wing tip rudders were deleted", "output": "Because they were no longer needed the FLAC's wing tip rudders were deleted."}
